GopalSaraf/Practicals/PSDL/include/proc/pic16f18424.h
extern volatile PWM7CONbits_t PWM7CONbits __at(0x392);
// bitfield macros
#define _PWM7CON_POL_POSN                                   0x4
#define _PWM7CON_POL_POSITION                               0x4
#define _PWM7CON_POL_SIZE                                   0x1
#define _PWM7CON_POL_LENGTH                                 0x1
#define _PWM7CON_POL_MASK                                   0x10
#define _PWM7CON_OUT_POSN                                   0x5
#define _PWM7CON_OUT_POSITION                               0x5
#define _PWM7CON_OUT_SIZE                                   0x1
#define _PWM7CON_OUT_LENGTH                                 0x1
#define _PWM7CON_OUT_MASK                                   0x20
#define _PWM7CON_EN_POSN                                    0x7
#define _PWM7CON_EN_POSITION                                0x7
#define _PWM7CON_EN_SIZE                                    0x1
#define _PWM7CON_EN_LENGTH                                  0x1
#define _PWM7CON_EN_MASK                                    0x80
#define _PWM7CON_PWM7POL_POSN                               0x4
#define _PWM7CON_PWM7POL_POSITION                           0x4
#define _PWM7CON_PWM7POL_SIZE                               0x1
#define _PWM7CON_PWM7POL_LENGTH                             0x1
#define _PWM7CON_PWM7POL_MASK                               0x10
#define _PWM7CON_PWM7OUT_POSN                               0x5
#define _PWM7CON_PWM7OUT_POSITION                           0x5
#define _PWM7CON_PWM7OUT_SIZE                               0x1
#define _PWM7CON_PWM7OUT_LENGTH                             0x1
#define _PWM7CON_PWM7OUT_MASK                               0x20
#define _PWM7CON_PWM7EN_POSN                                0x7
#define _PWM7CON_PWM7EN_POSITION                            0x7
#define _PWM7CON_PWM7EN_SIZE                                0x1
#define _PWM7CON_PWM7EN_LENGTH                              0x1
#define _PWM7CON_PWM7EN_MASK                                0x80

// Register: SMT1TMR
#define SMT1TMR SMT1TMR
#ifndef __CCI__
extern volatile __uint24                SMT1TMR             __at(0x48C);
#endif
#ifndef _LIB_BUILD
asm("SMT1TMR equ 048Ch");
#endif

// Register: SMT1TMRL
#define SMT1TMRL SMT1TMRL
extern volatile unsigned char           SMT1TMRL            __at(0x48C);
#ifndef _LIB_BUILD
asm("SMT1TMRL equ 048Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned TMR0                   :1;
        unsigned TMR1                   :1;
        unsigned TMR2                   :1;
        unsigned TMR3                   :1;
        unsigned TMR4                   :1;
        unsigned TMR5                   :1;
        unsigned TMR6                   :1;
        unsigned TMR7                   :1;
    };
    struct {
        unsigned SMT1TMR                :8;
    };
    struct {
        unsigned SMT1TMR0               :1;
        unsigned SMT1TMR1               :1;
        unsigned SMT1TMR2               :1;
        unsigned SMT1TMR3               :1;
        unsigned SMT1TMR4               :1;
        unsigned SMT1TMR5               :1;
        unsigned SMT1TMR6               :1;
        unsigned SMT1TMR7               :1;
    };
} SMT1TMRLbits_t;
extern volatile SMT1TMRLbits_t SMT1TMRLbits __at(0x48C);
// bitfield macros
#define _SMT1TMRL_TMR_POSN                                  0x0
#define _SMT1TMRL_TMR_POSITION                              0x0
#define _SMT1TMRL_TMR_SIZE                                  0x8
#define _SMT1TMRL_TMR_LENGTH                                0x8
#define _SMT1TMRL_TMR_MASK                                  0xFF
#define _SMT1TMRL_TMR0_POSN                                 0x0
#define _SMT1TMRL_TMR0_POSITION                             0x0
#define _SMT1TMRL_TMR0_SIZE                                 0x1
#define _SMT1TMRL_TMR0_LENGTH                               0x1
#define _SMT1TMRL_TMR0_MASK                                 0x1
#define _SMT1TMRL_TMR1_POSN                                 0x1
#define _SMT1TMRL_TMR1_POSITION                             0x1
#define _SMT1TMRL_TMR1_SIZE                                 0x1
#define _SMT1TMRL_TMR1_LENGTH                               0x1
#define _SMT1TMRL_TMR1_MASK                                 0x2
#define _SMT1TMRL_TMR2_POSN                                 0x2
#define _SMT1TMRL_TMR2_POSITION                             0x2
#define _SMT1TMRL_TMR2_SIZE                                 0x1
#define _SMT1TMRL_TMR2_LENGTH                               0x1
#define _SMT1TMRL_TMR2_MASK                                 0x4
#define _SMT1TMRL_TMR3_POSN                                 0x3
#define _SMT1TMRL_TMR3_POSITION                             0x3
#define _SMT1TMRL_TMR3_SIZE                                 0x1
#define _SMT1TMRL_TMR3_LENGTH                               0x1
#define _SMT1TMRL_TMR3_MASK                                 0x8
#define _SMT1TMRL_TMR4_POSN                                 0x4
#define _SMT1TMRL_TMR4_POSITION                             0x4
#define _SMT1TMRL_TMR4_SIZE                                 0x1
#define _SMT1TMRL_TMR4_LENGTH                               0x1
#define _SMT1TMRL_TMR4_MASK                                 0x10
#define _SMT1TMRL_TMR5_POSN                                 0x5
#define _SMT1TMRL_TMR5_POSITION                             0x5
#define _SMT1TMRL_TMR5_SIZE                                 0x1
#define _SMT1TMRL_TMR5_LENGTH                               0x1
#define _SMT1TMRL_TMR5_MASK                                 0x20
#define _SMT1TMRL_TMR6_POSN                                 0x6
#define _SMT1TMRL_TMR6_POSITION                             0x6
#define _SMT1TMRL_TMR6_SIZE                                 0x1
#define _SMT1TMRL_TMR6_LENGTH                               0x1
#define _SMT1TMRL_TMR6_MASK                                 0x40
#define _SMT1TMRL_TMR7_POSN                                 0x7
#define _SMT1TMRL_TMR7_POSITION                             0x7
#define _SMT1TMRL_TMR7_SIZE                                 0x1
#define _SMT1TMRL_TMR7_LENGTH                               0x1
#define _SMT1TMRL_TMR7_MASK                                 0x80
#define _SMT1TMRL_SMT1TMR_POSN                              0x0
#define _SMT1TMRL_SMT1TMR_POSITION                          0x0
#define _SMT1TMRL_SMT1TMR_SIZE                              0x8
#define _SMT1TMRL_SMT1TMR_LENGTH                            0x8
#define _SMT1TMRL_SMT1TMR_MASK                              0xFF
#define _SMT1TMRL_SMT1TMR0_POSN                             0x0
#define _SMT1TMRL_SMT1TMR0_POSITION                         0x0
#define _SMT1TMRL_SMT1TMR0_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR0_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR0_MASK                             0x1
#define _SMT1TMRL_SMT1TMR1_POSN                             0x1
#define _SMT1TMRL_SMT1TMR1_POSITION                         0x1
#define _SMT1TMRL_SMT1TMR1_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR1_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR1_MASK                             0x2
#define _SMT1TMRL_SMT1TMR2_POSN                             0x2
#define _SMT1TMRL_SMT1TMR2_POSITION                         0x2
#define _SMT1TMRL_SMT1TMR2_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR2_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR2_MASK                             0x4
#define _SMT1TMRL_SMT1TMR3_POSN                             0x3
#define _SMT1TMRL_SMT1TMR3_POSITION                         0x3
#define _SMT1TMRL_SMT1TMR3_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR3_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR3_MASK                             0x8
#define _SMT1TMRL_SMT1TMR4_POSN                             0x4
#define _SMT1TMRL_SMT1TMR4_POSITION                         0x4
#define _SMT1TMRL_SMT1TMR4_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR4_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR4_MASK                             0x10
#define _SMT1TMRL_SMT1TMR5_POSN                             0x5
#define _SMT1TMRL_SMT1TMR5_POSITION                         0x5
#define _SMT1TMRL_SMT1TMR5_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR5_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR5_MASK                             0x20
#define _SMT1TMRL_SMT1TMR6_POSN                             0x6
#define _SMT1TMRL_SMT1TMR6_POSITION                         0x6
#define _SMT1TMRL_SMT1TMR6_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR6_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR6_MASK                             0x40
#define _SMT1TMRL_SMT1TMR7_POSN                             0x7
#define _SMT1TMRL_SMT1TMR7_POSITION                         0x7
#define _SMT1TMRL_SMT1TMR7_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR7_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR7_MASK                             0x80

// Register: SMT1TMRH
#define SMT1TMRH SMT1TMRH
extern volatile unsigned char           SMT1TMRH            __at(0x48D);
#ifndef _LIB_BUILD
asm("SMT1TMRH equ 048Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned TMR8                   :1;
        unsigned TMR9                   :1;
        unsigned TMR10                  :1;
        unsigned TMR11                  :1;
        unsigned TMR12                  :1;
        unsigned TMR13                  :1;
        unsigned TMR14                  :1;
        unsigned TMR15                  :1;
    };
    struct {
        unsigned SMT1TMR                :8;
    };
    struct {
        unsigned SMT1TMR8               :1;
        unsigned SMT1TMR9               :1;
        unsigned SMT1TMR10              :1;
        unsigned SMT1TMR11              :1;
        unsigned SMT1TMR12              :1;
        unsigned SMT1TMR13              :1;
        unsigned SMT1TMR14              :1;
        unsigned SMT1TMR15              :1;
    };
} SMT1TMRHbits_t;
