GopalSaraf/Practicals/PSDL/include/proc/pic16f18424.h
// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0x711);
#ifndef _LIB_BUILD
asm("PIR5 equ 0711h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1GIF                :1;
        unsigned TMR3GIF                :1;
        unsigned TMR5GIF                :1;
        unsigned                        :1;
        unsigned CLC1IF                 :1;
        unsigned CLC2IF                 :1;
        unsigned CLC3IF                 :1;
        unsigned CLC4IF                 :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0x711);
// bitfield macros
#define _PIR5_TMR1GIF_POSN                                  0x0
#define _PIR5_TMR1GIF_POSITION                              0x0
#define _PIR5_TMR1GIF_SIZE                                  0x1
#define _PIR5_TMR1GIF_LENGTH                                0x1
#define _PIR5_TMR1GIF_MASK                                  0x1
#define _PIR5_TMR3GIF_POSN                                  0x1
#define _PIR5_TMR3GIF_POSITION                              0x1
#define _PIR5_TMR3GIF_SIZE                                  0x1
#define _PIR5_TMR3GIF_LENGTH                                0x1
#define _PIR5_TMR3GIF_MASK                                  0x2
#define _PIR5_TMR5GIF_POSN                                  0x2
#define _PIR5_TMR5GIF_POSITION                              0x2
#define _PIR5_TMR5GIF_SIZE                                  0x1
#define _PIR5_TMR5GIF_LENGTH                                0x1
#define _PIR5_TMR5GIF_MASK                                  0x4
#define _PIR5_CLC1IF_POSN                                   0x4
#define _PIR5_CLC1IF_POSITION                               0x4
#define _PIR5_CLC1IF_SIZE                                   0x1
#define _PIR5_CLC1IF_LENGTH                                 0x1
#define _PIR5_CLC1IF_MASK                                   0x10
#define _PIR5_CLC2IF_POSN                                   0x5
#define _PIR5_CLC2IF_POSITION                               0x5
#define _PIR5_CLC2IF_SIZE                                   0x1
#define _PIR5_CLC2IF_LENGTH                                 0x1
#define _PIR5_CLC2IF_MASK                                   0x20
#define _PIR5_CLC3IF_POSN                                   0x6
#define _PIR5_CLC3IF_POSITION                               0x6
#define _PIR5_CLC3IF_SIZE                                   0x1
#define _PIR5_CLC3IF_LENGTH                                 0x1
#define _PIR5_CLC3IF_MASK                                   0x40
#define _PIR5_CLC4IF_POSN                                   0x7
#define _PIR5_CLC4IF_POSITION                               0x7
#define _PIR5_CLC4IF_SIZE                                   0x1
#define _PIR5_CLC4IF_LENGTH                                 0x1
#define _PIR5_CLC4IF_MASK                                   0x80

// Register: PIR6
#define PIR6 PIR6
extern volatile unsigned char           PIR6                __at(0x712);
#ifndef _LIB_BUILD
asm("PIR6 equ 0712h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1IF                 :1;
        unsigned CCP2IF                 :1;
        unsigned CCP3IF                 :1;
        unsigned CCP4IF                 :1;
    };
} PIR6bits_t;
extern volatile PIR6bits_t PIR6bits __at(0x712);
// bitfield macros
#define _PIR6_CCP1IF_POSN                                   0x0
#define _PIR6_CCP1IF_POSITION                               0x0
#define _PIR6_CCP1IF_SIZE                                   0x1
#define _PIR6_CCP1IF_LENGTH                                 0x1
#define _PIR6_CCP1IF_MASK                                   0x1
#define _PIR6_CCP2IF_POSN                                   0x1
#define _PIR6_CCP2IF_POSITION                               0x1
#define _PIR6_CCP2IF_SIZE                                   0x1
#define _PIR6_CCP2IF_LENGTH                                 0x1
#define _PIR6_CCP2IF_MASK                                   0x2
#define _PIR6_CCP3IF_POSN                                   0x2
#define _PIR6_CCP3IF_POSITION                               0x2
#define _PIR6_CCP3IF_SIZE                                   0x1
#define _PIR6_CCP3IF_LENGTH                                 0x1
#define _PIR6_CCP3IF_MASK                                   0x4
#define _PIR6_CCP4IF_POSN                                   0x3
#define _PIR6_CCP4IF_POSITION                               0x3
#define _PIR6_CCP4IF_SIZE                                   0x1
#define _PIR6_CCP4IF_LENGTH                                 0x1
#define _PIR6_CCP4IF_MASK                                   0x8

// Register: PIR7
#define PIR7 PIR7
extern volatile unsigned char           PIR7                __at(0x713);
#ifndef _LIB_BUILD
asm("PIR7 equ 0713h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWG1IF                 :1;
        unsigned CWG2IF                 :1;
        unsigned                        :2;
        unsigned NCO1IF                 :1;
        unsigned NVMIF                  :1;
    };
} PIR7bits_t;
extern volatile PIR7bits_t PIR7bits __at(0x713);
// bitfield macros
#define _PIR7_CWG1IF_POSN                                   0x0
#define _PIR7_CWG1IF_POSITION                               0x0
#define _PIR7_CWG1IF_SIZE                                   0x1
#define _PIR7_CWG1IF_LENGTH                                 0x1
#define _PIR7_CWG1IF_MASK                                   0x1
#define _PIR7_CWG2IF_POSN                                   0x1
#define _PIR7_CWG2IF_POSITION                               0x1
#define _PIR7_CWG2IF_SIZE                                   0x1
#define _PIR7_CWG2IF_LENGTH                                 0x1
#define _PIR7_CWG2IF_MASK                                   0x2
#define _PIR7_NCO1IF_POSN                                   0x4
#define _PIR7_NCO1IF_POSITION                               0x4
#define _PIR7_NCO1IF_SIZE                                   0x1
#define _PIR7_NCO1IF_LENGTH                                 0x1
#define _PIR7_NCO1IF_MASK                                   0x10
#define _PIR7_NVMIF_POSN                                    0x5
#define _PIR7_NVMIF_POSITION                                0x5
#define _PIR7_NVMIF_SIZE                                    0x1
#define _PIR7_NVMIF_LENGTH                                  0x1
#define _PIR7_NVMIF_MASK                                    0x20

// Register: PIR8
#define PIR8 PIR8
extern volatile unsigned char           PIR8                __at(0x714);
#ifndef _LIB_BUILD
asm("PIR8 equ 0714h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1IF                 :1;
        unsigned SMT1PRAIF              :1;
        unsigned SMT1PWAIF              :1;
    };
} PIR8bits_t;
